
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		Объект.ЭтоУслуга = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)

	ТабДок = СформироватьПечатнуюФорму();
	ТабДок.Показать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьПечатнуюФорму()

	Макет = Справочники.НоменклатурныеГруппы.ПолучитьМакет("ПечатнаяФорма");

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Наименование = "Наименование";
	ОбластьШапка.Параметры.ЭтоУслуга = "Это услуга";

	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Параметры.Наименование = Объект.Наименование;
	ОбластьСтрока.Параметры.ЭтоУслуга = ?(Объект.ЭтоУслуга, "Да", "Нет");

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(ОбластьСтрока);

	Возврат ТабДок;

КонецФункции

#КонецОбласти
