#Область ОписаниеПеременных

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сообщить("111");	
	Сообщить("222");	
	Сообщить("333");	
	Сообщить("444");	
КонецПроцедуры


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные();

КонецПроцедуры
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#Область ууу
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
КонецПроцедуры
#КонецОбласти
	
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти